
    /* jQuery គឺជាបណ្ណាល័យ JavaScript
    ដែលផ្តល់នូវប្រភេទវត្ថុប្រើប្រាស់ជាច្រើនសម្រាប់យកមកបង្កើតវេបផេកដែលអាចប្រែប្រួលខ្លួនឯងដោយប្រើធនធានរបស់ម៉ាស៊ីនអ្នកទស្សនា។
    *ចំណាំ រាល់កូដ jQuery តែងផ្តើមដោយសញ្ញា $
    
    Jquery Ready event ជាព្រឹត្តិការណ៏ដែលកំណត់ថាកូដដំណើរការនៅពេលវេបផេកដំណើររួចរាល់ពោលគឺ អត្ថបទ រូបភាព បញ្ជី តារាង ដែលមានក្នុង
    វេបផេក browser

    របៀបសរសេ​ read event
      ទម្រង់ធម្មតា
      $(document).ready(function(){
        កូដត្រូវដំណើរការ;
      });

    ដើម្បីប្រើប្រាស់ jQuery ត្រូវ

    ក. ប្រើធាតុ​ script ដើម្បីភ្ជាប់ទៅកាន់ឯកសារបណ្ណាល័យ​ jQuery 
    ខ. បង្កើតឯកសារ Javascript ថ្មីមួយសម្រាប់សរសេរកូដ jQuery
    គ. ប្រើធាតុ script​ ដើម្បីភ្ចាប់ទៅកាន់ឯកសារ Javascript ទើបបានបង្កើត
    ឃ. ផ្តើមសរសេរក្នុងឯកសារ Javascript ដោយប្រើ jQuery ready event



    jquery events 
    $(selector).ឈ្មោះevent (function(បញ្ជីប៉ារ៉ាម៉ែត្របើមាន){

    });
    ឬ
    $(selector).on("ឈ្មោះevent",function(បញ្ជីប៉ារ៉ាម៉ែត្របើមាន){

    });

    ប្រើប្រាស់ធាតុដែល
    .html()ទាញយកតម្លៃជា​ HTML
    .html("កូដHTML")កែតម្លៃជា​ HTML
    .text()​ ទាញយកតម្លៃខ្លឺមសារ
    .text("ខ្លឺមសារថ្មី")កែតម្លៃ
    .attr("ឈ្មោះattribute") ទាញយកតម្លៃគុណលក្ខណះ
    .attr("ឈ្មោះattribute","តម្លៃថ្មី") កែ្ឲតម្លៃគុណលក្ខណះ
    .css("ឈ្មោះproperty")​ ទាញយកតម្លៃរបស់ css property
    .css("ឈ្មោះproperty", "តម្លៃថ្មី") កែតម្លៃរបស់ css property
    .val() ទាញយកតម្លៃរបស់ធាតុថិតនៅក្នងសំណុំបេបបទ(form)
    .val("តម្លៃថ្មី") កែតម្លៃរបស់ធាតុរបស់ធាតុថិតនៅក្នងសំណុំបែបបទ(form)​


    */
 